#!/bin/bash

congratulate() {
    echo -e "\e[1;33mС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рожденияС днем рождения, С днем рождения,$С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,С днем рождения,ЗАЙДИ СЮДА СОЛНЫШКО https://www.davno.ru/cards/bd/birthday-1342.html  ,,!\e[0m"
}



name=$1

if [ -z "$name" ]; then
    read -p "Введите имя человека, которого вы хотите поздравить: " name
fi

congratulate "$name"
